soap/miniupnp/miniupnpd-2.1-igd2/seeds/17_WANIPC-AddPortMapping_2

<?xml version="1.0" encoding="UTF-8"?><s:Envelope s:encodingStyle="http://schemas.xmlsoap.org/soap/encoding/" xmlns:s="http://schemas.xmlsoap.org/soap/envelope/" xmlns:soapenc="http://schemas.xmlsoap.org/soap/encoding/" ><s:Body><u:AddPortMapping xmlns:u="urn:schemas-upnp-org:service:WANIPConnection:2"><NewRemoteHost>hcB(.*-uyi%IuP3$</NewRemoteHost><NewExternalPort>14514</NewExternalPort><NewProtocol>UDP</NewProtocol><NewInternalPort>22884</NewInternalPort><NewInternalClient>Bhs]pS*xCKA5|8aS</NewInternalClient><NewEnabled>1</NewEnabled><NewPortMappingDescription>s7g{d'qt,*ptzud4</NewPortMappingDescription><NewLeaseDuration>517397</NewLeaseDuration></u:AddPortMapping></s:Body></s:Envelope>
